[
    {
        "id": 188350,
        "title": "Seafood Ehomaki (Lucky Fat Sushi Rolls)",
        "story": "Since year after year, my family won't eat store-bought ehomaki, so I make them at home with seafood filling. By serving home-made ehomaki, I can save money, too.\r\n\r\nWith about 720 to 900 ml of uncooked rice I was able to make 5 sushi rolls with a little bit of leftover sushi rice. Wrapping them with a sushi mat is, of course, OK! My kids and husband don't really like futomaki with dried gourd shavings or denbu (dried fish flakes), so I made ones that they would like. For those using store-bought sushi vinegar, please use 135 ml. For 5 servings. Recipe by Kyoku.",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5059448610488320.jpg",
        "published_at": "2021-12-22T04:53:00+00:00",
        "user": {
            "name": "Nova",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 Cooked white rice 4 to 5 rice cooker cups (1320 to 1650 grams cooked, using 720 ml to 900 ml uncooked raw rice)",
            "10 cm Kombu",
            "2 tbsp Sake",
            "3 to 5 tablespoons ○ Sugar",
            "1 tsp ○ Salt",
            "1 dash over 100 ml ○ Vinegar",
            "5 to 7 sheets, nori seaweed",
            "200 grams Sashimi grade tuna",
            "120 grams Salmon (smoked or sashimi grade)",
            "150 grams Squid (sashimi grade)",
            "5/8 Cucumber",
            "50 grams Shredded egg crepes (or Japanese atsuyaki thick omlette or dashimaki rolled omlette)"
        ],
        "steps": [
            {
                "description": "I use a handy fat sushi roll mold that I bought at a 100 yen shop, but you can also use a sushi mat.  After rinsing the rice, I strain it and let it sit for 30 minutes. Then, I make small cuts on both sides of the konbu, add it to the rice together with sake, and then cook the rice. Next, I mix in the seasoned rice vinegar and cool off the rice with a hand-held fan. Finally, I put a damp cloth over the rice.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4686671856533504.jpg"
                ]
            },
            {
                "description": "The next step is to gather the filling ingredients. Shredded egg crepes, cucumbers, squid, salmon (either cheap smoked salmon or sashimi), and fresh, sashimi grade tuna. This will complete your color palatte of yellow, green, white, orange and red. Aside from the shredded egg crepe, all the ingredients should be cut lengthwise. For adults, use squid or salmon, together with a touch of wasabi.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5954519585259520.jpg"
                ]
            },
            {
                "description": "Wet the inner surface of the mold each time with water. Fill the mold with sushi rice, lay a 1/2 sheet of sushi nori in the center, arrange the fillers inside the nori, taking care to balance the colors, and seal the nori around fillers. Fill the rest of the mold with sushi rice and press the cover on.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5984909968539648.jpg"
                ]
            },
            {
                "description": "Drop the contents onto a sheet of sushi nori and roll to create an instant futomaki fat sushi roll! Even after making 5 rolls, a small bowl of sushi rice is left over. You can use that to make a mini Tekkadon (sushi rice topped with thin-sliced raw tuna sashimi) or Nattodon (sushi rice topped with fermented soy beans).",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5209213180575744.jpg"
                ]
            },
            {
                "description": "Cut them to serve. If you want to use less rice, just add more ingredients, if you please.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6237037836369920.jpg"
                ]
            },
            {
                "description": "Since my eldest son loves any kind of sashimi tuna, I fill these with plenty of tuna.",
                "image_urls": []
            }
        ]
    },
    {
        "id": 302399,
        "title": "Chili Con Carne-style Vegetable Salad",
        "story": "By using raw vegetables, you can make a raw food-style salad. Serve with great with corn bread. Recipe by conamonn.\r\nrecipe written on 10/12/2014",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/37a38d56cc03bb8e.jpg",
        "published_at": "2021-10-20T03:36:45+00:00",
        "user": {
            "name": "Wilhemina",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "If It's Too Much, Make 1/2 Or 1/4 of a Batch",
            "1 packages premade chili seasoning",
            "80 ml or more water",
            "1/2 tsp salt",
            "400 grams canned diced tomatoes",
            "Vegetables",
            "to taste green peppers, red peppers, corn kernals",
            "Seasonings",
            "to taste sweet chili sauce, mexican dressing, green tabasco sauce"
        ],
        "steps": [
            {
                "description": "Combine the chili seasoning, (salt), and canned tomatoes.",
                "image_urls": []
            },
            {
                "description": "Mix in the cut peppers and thawed corn kernels.",
                "image_urls": []
            },
            {
                "description": "Top with sweet chili sauce and enjoy.",
                "image_urls": []
            },
            {
                "description": "If you simmer it, it will become a vegetable chili con carne.",
                "image_urls": []
            }
        ]
    },
    {
        "id": 150830,
        "title": "How to Make a Beautiful Egg Salad Sandwich",
        "story": "I wanted to make a tasty egg salad sandwich and I love making dishes for events. A lot of my recipes are easy enough so your kids can help out too! (Recipe by Kodomoto Tsukuru Uchigohan)",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/4955414308323328.jpg",
        "published_at": "2021-05-15T07:48:04+00:00",
        "user": {
            "name": "Raymon",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "2 slice Sliced sandwich bread",
            "1 to 2 Eggs",
            "1 slice Ham",
            "1 Cucumber",
            "Mayonnaise",
            "Salt and pepper"
        ],
        "steps": [
            {
                "description": "Boil the eggs, and scramble while hot. Season with salt and pepper, then chill overnight in refrigerator.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4852988242821120.jpg"
                ]
            },
            {
                "description": "The next day, add the mayonnaise to balance the flavors. Put sandwich ham, cucumbers, and the egg salad between the sliced bread, and serve.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6332641923039232.jpg"
                ]
            },
            {
                "description": "Recipe Tip: To help the flavors come together more easily, season with salt and pepper while hot, and add the mayonnaise after it cools!",
                "image_urls": []
            }
        ]
    },
    {
        "id": 145482,
        "title": "Grilled Pacific Saury Sushi with Black Rice",
        "story": "Black rice is so beautiful!\r\n\r\nIf you have fresh fish, just sear the surface. Otherwise, grill it through well.\r\nUse glutinous black rice. It's highly nutritious, chewy, and filling. It looks pretty too. Recipe by pegupepepe. (About 8 sushi, for two)",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/6442345938550784.jpg",
        "published_at": "2021-12-19T02:34:00+00:00",
        "user": {
            "name": "Graciela",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "2 Pacific saury, sashimi quality",
            "1 dash Salt",
            "180 ml White rice",
            "3 tbsp Black rice",
            "1 tbsp Sake and 1 sheet of kombu seaweed (5 cm square)",
            "1 Sushi vinegar",
            "1 optional Grated daikon radish",
            "1 optional Okahijiki (type of saltwort)",
            "1 optional Shiso seeds",
            "1 optional Kabosu citrus"
        ],
        "steps": [
            {
                "description": "Make the sushi rice. Mix about 3 tablespoons of black rice and 1 tablespoon of sake with 180 ml of uncooked white rice. Add konbu seaweed to the rice cooker and set to cook.",
                "image_urls": []
            },
            {
                "description": "Transfer the cooked rice into a large bowl and drizzle the sushi vinegar. Let rest for about 10 seconds to allow the rice to absorb the vinegar (use a sushi rice tub if available).",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5233067764482048.jpg"
                ]
            },
            {
                "description": "Mix the rice well with a cutting motion and cool down with a fan at the same time. After it's cooled down, cover with a moistened tea towel on top to keep the rice moist and soft.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5323827637649408.jpg"
                ]
            },
            {
                "description": "The aroma of grilled Pacific saury is irresistible. I like aji (horse mackerel) seared quickly, but I like pacific saury grilled well.",
                "image_urls": []
            },
            {
                "description": "Since the fish will be grilled, it's fine to use leftover fish on sale at the end of the day. Whenever I find special offers, I always buy several to freeze.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4708484384817152.jpg"
                ]
            },
            {
                "description": "Rinse the fish and sprinkle with salt. Leave to stand for a while to get rid of the fishy smell. Salting helps remove the fishy smell.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5758812026830848.jpg"
                ]
            },
            {
                "description": "Rinse the fish gently and pat dry. Let's start grilling.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6095263356682240.jpg"
                ]
            },
            {
                "description": "If you have fresh fish, you could sear the surface with a blow torch.",
                "image_urls": []
            },
            {
                "description": "Otherwise, you can use your grill.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6467105619705856.jpg"
                ]
            },
            {
                "description": "After grilling, slice the flesh on the diagonal and top with the sushi rice to make nigiri sushi. Plate and serve!",
                "image_urls": []
            },
            {
                "description": "I put kabosu citrus, cooked okahijiki, grated daikon radish and shisho seeds next to the sushi.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5074647593779200.jpg"
                ]
            },
            {
                "description": "This sushi rice made with black rice looks beautiful, doesn't it?",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5187455413125120.jpg"
                ]
            },
            {
                "description": "Squeeze the kabosu citrus and sprinkle with a little soy sauce. Have a bite!",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4663598721794048.jpg"
                ]
            },
            {
                "description": "The sushi rice with black rice changes its colour immediately when mixed in with vinegar. The rice is packed with color as well as flavor.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4826193802035200.jpg"
                ]
            }
        ]
    },
    {
        "id": 302378,
        "title": "Oil-free Baked Savory Donuts",
        "story": "These baked donuts are lighter than ones that contain butter and smell great too. Try slicing them in half like bagels and sandwich raw veggies. They have an unusual texture that goes so well with the veggies. Recipe by conamonn.\r\nrecipe written on 10/12/2014",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/284cab3adcb0d6ea.jpg",
        "published_at": "2021-10-20T03:25:20+00:00",
        "user": {
            "name": "Shonta",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "210 grams cake flour",
            "10 grams aluminum-free baking powder",
            "60 grams honey (acacia, etc) for moist donuts",
            "24 grams skim milk powder",
            "2/3-1 tsp krazy salt",
            "2 eggs",
            "120 grams plain yogurt",
            "60 grams milk (don't use soy milk, they'll become dense) Fillings, Toppings Etc.",
            "to taste cheese (easy melting type, sliced or whatever you'd like, or even vegetarian cheese)",
            "to taste meat (ham, sausage, bacon etc), fish (salted salmon, shirasu etc.)",
            "to taste vegetables (canned corn, cooked vegetables, etc), herbs (dried parsley, etc.) - the donuts will become doughy don't add too many vegetables"
        ],
        "steps": [
            {
                "description": "Mix the batter ingredients together.",
                "image_urls": []
            },
            {
                "description": "Fill the donut molds evenly with cheese, vegetables, meat etc. Pour the batter in over them.",
                "image_urls": []
            },
            {
                "description": "Don't mix the vegetables etc. into the batter, or the batter will get too watery.",
                "image_urls": []
            },
            {
                "description": "Bake at 180°C for 15 minutes. Don't overbake these! Bake for a shorter time than regular baked donuts. Adjust the time depending on your oven.",
                "image_urls": []
            },
            {
                "description": "You can adjust the consistency of the batter with milk (or water). I've listed an average amount in the recipe, so if there are any issues please try adding more or less milk or water.",
                "image_urls": []
            },
            {
                "description": "Don't mix grated cheese into the batter - the donuts will become hard. It's best to sprinkle cheese into the bottom of the donut molds.",
                "image_urls": []
            },
            {
                "description": "The honey is indispensable for the texture of the batter. Don't reduce it too much.",
                "image_urls": []
            },
            {
                "description": "Slice the donuts in half and make raw vegetable sandwiches. The crispy texture is irresistible ♪ Apparently shops that sell cake salé (savory cakes) use their leftover cakes for vegetable sandwiches.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/d38f38d804ab68db.jpg"
                ]
            }
        ]
    },
    {
        "id": 154638,
        "title": "Sukiyaki (with Kansai-style Warishita Sauce)",
        "story": "In the Kansai region, we usually don't use warishita sauce, but we add sugar, soy sauce, sake and other seasonings one at a time. It's bothersome so I combined the ingredients together. Not adding water or dashi stock is the Kansai way, I think. I had good feedback on this dish, so I posted the recipe.\r\n\r\nAdd the warishita little by little as you add the ingredients. If you have leftover warishita, use as seasoning for teriyaki dishes or sesame sauce. Recipe by Gima-ru",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5873714515148800.jpg",
        "published_at": "2021-12-22T02:05:00+00:00",
        "user": {
            "name": "Brenton",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "500 grams Thinly sliced beef for sukiyaki",
            "1/4 Chinese cabbage, small",
            "1/2 Onion",
            "1 bunch Chrysanthemum greens",
            "1 pack Shiitake mushrooms",
            "1 pack Enoki mushrooms",
            "1 Japanese leek",
            "1/2 to 1 block Grilled tofu",
            "1 pack Shirataki noodles (konnyaku noodles)",
            "1 Fresh eggs",
            "6 tbsp ●Soy sauce",
            "4 tbsp or more ●Sugar",
            "5 tbsp ●Sake"
        ],
        "steps": [
            {
                "description": "How to make warishita: In a pot or in the microwave, heat the ● seasonings. If microwaving, microwave for 2 minutes at  500W. Stir well to dissolve the sugar.",
                "image_urls": []
            },
            {
                "description": "Cut or slice the ingredients to preferable bite sizes.",
                "image_urls": []
            },
            {
                "description": "Heat a sukiyaki iron pot and melt the beef fat. After the pan is hot, quickly fry several slices of beef. Add the warishita sauce and let it absorb into the beef. (At this point, take a bite! This first bite is particularly great and you can enjoy the great taste of beef.)",
                "image_urls": []
            },
            {
                "description": "Add vegetables and other ingredients, pour the warishita sauce, and bring to a simmer. Dip in a beaten egg and enjoy!",
                "image_urls": []
            }
        ]
    },
    {
        "id": 150970,
        "title": "Colourful Oshi Sushi (Pressed Sushi) with Chicken Teriyaki",
        "story": "I wanted to serve up a good-looking chicken teriyaki dish for a party, so I came up with this.\n\nDon't overcook or undercook the chicken. Pack the ingredients into a mold, then press down on them firmly to get a well-formed pressed sushi. If you don't press hard enough, the sushi will fall apart easily when you slice it. Recipe by Rirapen",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/6407136440483840.jpg",
        "published_at": "2021-07-03T05:46:00+00:00",
        "user": {
            "name": "Antony",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 Chicken thigh",
            "2 1/2 tbsp Soy sauce",
            "2 1/2 tbsp Honey",
            "3 Eggs",
            "1 tbsp Milk",
            "400 grams Plain cooked rice",
            "2 and half slices Sliced cheese",
            "6 tomatoes Cherry tomatoes (Cut a cherry tomato into eight pieces)",
            "1 Radish sprouts (cut into 1.5 cm pieces)"
        ],
        "steps": [
            {
                "description": "Put the eggs and milk in a bowl and stir. Heat a pot, and pour the mixture into it. Hold four cooking chopsticks with one hand and stir the mixture with them to make scrambled eggs.",
                "image_urls": []
            },
            {
                "description": "Make a slit on the chicken thigh on the meat side. Arrange the chicken thighs skin side-down in a frying-pan.",
                "image_urls": []
            },
            {
                "description": "Heat the frying-pan, and cook the chicken over medium heat until golden brown. Turn the chicken thigh over, and once it begins to sizzle, cover with a lid and continue to cook.",
                "image_urls": []
            },
            {
                "description": "Drizzle the soy sauce and honey over the chicken, coating evenly. Let it cool, dicing the chicken up. Save the sauce that's left in the pan.",
                "image_urls": []
            },
            {
                "description": "Line the pound cake tin with plastic wrap. Add the ingredients in layers starting with the chicken thigh, then rice, scrambled egg, cheese, scrambled egg and rice. Press hard from the top to pack the ingredients in tightly.",
                "image_urls": []
            },
            {
                "description": "Serve the sushi on a plate. Heat the sauce in the frying-pan and it pour over the sushi. Garnish with cherry tomatoes and radish sprouts.",
                "image_urls": []
            }
        ]
    },
    {
        "id": 302335,
        "title": "Persimmon and Sweet Potato Salad Spiced with Wasabi",
        "story": "Wasabi combined with persimmons and sweet potatoes. Seems like an unlikely combination, but it's oh-so-delicious. Recipe by Hakka pan\r\nrecipe written on 10/12/2014",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/d6e7d16b33cd2fcc.jpg",
        "published_at": "2021-10-20T02:32:39+00:00",
        "user": {
            "name": "Hosea",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 persimmon",
            "1 medium ○sweet potato",
            "50 ml ○water",
            "1/2 cucumbers",
            "1/4 onions (finely chopped)",
            "1 tsp ☆wasabi",
            "2 tsp ☆honey",
            "2 tsp ☆lemon juice",
            "1 pinch ☆salt",
            "2 tbsp ☆sunflower oil (or vegetable oil)"
        ],
        "steps": [
            {
                "description": "Combine the ☆ ingredients. Combine the wasabi with honey first, add lemon juice and salt, then finally the oil to emulsify.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/ffcec54cd9b3d2fe.jpg"
                ]
            },
            {
                "description": "Cut the cucumbers lengthwise into half, then into diagonal slices. Mince the onions. Combine in a bowl, rub with a pinch of salt (not listed), and let rest.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/accd0b846d3be54d.jpg"
                ]
            },
            {
                "description": "Slice the potatoes 1 cm thick and soak in water for 5 minutes. Toss in the frying pan, avoiding the pieces from overlapping each other. Add water.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/a08d44aa15d61315.jpg"
                ]
            },
            {
                "description": "Turn on the heat and once it comes to a boil, bring down the heat to the lowest, cover with a lid, and steam until the potatoes soften. Remove the lid once the potatoes are soft enough and evaporate any leftover water.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/0610ae653f219998.jpg"
                ]
            },
            {
                "description": "While the potatoes are still hot, mash roughly and combine with the ingredients from Step 1. Mash to your desired consistency. I like leaving chunks.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/881503a9d9f2a56b.jpg"
                ]
            },
            {
                "description": "Remove the leaves of the persimmon and dice into 1 cm.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/e2a673defb939bb0.jpg"
                ]
            },
            {
                "description": "Once the potatoes have cooled, combine the tightly squeezed cucumbers and onions, persimmons, and toss.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/1b5e606168b376eb.jpg"
                ]
            }
        ]
    },
    {
        "id": 153420,
        "title": "Inari Sushi with Nuts and Dried Fruits",
        "story": "I originally created this recipe as an entry for a recipe contest sponsored by the company that sells the nuts and dried fruits I used. However, the theme of the contest was rather extravagant and I didn't think this fit well, so I entered it in a healthy eating recipe contest sponsored by another company instead. \nI made these inari sushi with the rice showing so they would be fun to look at.\n\nI used the sweetness of the dried fruit only, and didn't add any sugar to the rice (as you usually would to sushi rice). \nThey are good when they're freshly made, but they are also delicious if made ahead of time for a party. I personally like them better after they have rested for a while. Recipe by Mizuki shan",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/4720996603920384.jpg",
        "published_at": "2021-06-26T18:55:00+00:00",
        "user": {
            "name": "Zula",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "180 ml Uncooked white rice",
            "50 grams Dried cranberries",
            "3 Dried apricots",
            "1 tbsp Pine nuts",
            "8 inarizushi worth Precooked aburaage for inari sushi",
            "30 grams Daikon radish sprouts",
            "1 tbsp Sake",
            "2/3 tsp Dashi stock granules",
            "1 Sudachi citrus fruit",
            "1 tbsp Vinegar"
        ],
        "steps": [
            {
                "description": "I used these pine nuts, apricots and cranberries. I like the packaging, which clearly lists the nutritional information of the contents.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6315834831011840.jpg"
                ]
            },
            {
                "description": "Wash 1 rice cooker cup worth of rice, and add a bit less water than usual. Put in the dried fruit, sake, and dashi stock granules.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6295698682150912.jpg"
                ]
            },
            {
                "description": "I used these store-bought inari sushi skins.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4786981977456640.jpg"
                ]
            },
            {
                "description": "Add the pine nuts to the freshly cooked rice, squeeze in the juice of one sudachi, and mix. The apricots will melt a little and add a subtle color to the rice.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6442282761846784.jpg"
                ]
            },
            {
                "description": "I wanted to use the sourness of the sudachi juice only, but I found that vinegar is needed after all. Add 1 tablespoon of vinegar and mix.",
                "image_urls": []
            },
            {
                "description": "Chop up the daikon radish sprouts and mix them into the rice. Stuff the rice into the inari sushi skins, and they're done.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4587424496746496.jpg"
                ]
            },
            {
                "description": "Bonus:  I didn't have enough of the premade inari sushi skins, so I chopped up 2 of them and mixed them with the remaining rice for a chirashi sushi-style dish.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5625471585746944.jpg"
                ]
            }
        ]
    },
    {
        "id": 302315,
        "title": "Dry-Roasted Soy Beans Pickled in Balsamic Vinegar",
        "story": "Just dry-roast some dried soy beans, and put them in a pickling liquid made with balsamic vinegar. These beans are spicy, sweet, and sour, and are very chewy, too. Recipe by Hakka pan\r\nrecipe written on 10/12/2014",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/310ce6452d8fdb6e.jpg",
        "published_at": "2021-10-20T02:09:44+00:00",
        "user": {
            "name": "Blair",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "100 grams dried soy beans",
            "For the Pickling Liquid:",
            "50 ml ☆balsamic vinegar",
            "50 ml ☆water",
            "15 grams ☆honey",
            "4 grams ☆salt",
            "4 grams ☆ spice mix for pickling"
        ],
        "steps": [
            {
                "description": "Put the ☆ ingredients in a pan and heat it up. Turn off the heat once it comes to a boil. (This is the pickling liquid.)",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/ed720d1945b516e1.jpg"
                ]
            },
            {
                "description": "Rinse the dried soy beans quickly, and dry roast them in a frying pan (over low-medium heat). When the skins split open and you can bite through them easily, they're done!",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/9780e1dba6cec9c8.jpg"
                ]
            },
            {
                "description": "Put the red-hot beans in the pickling liquid. The beans will start soaking up the liquid right away. Let the beans cool down while mixing occasionally.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/dab3afa4e4568904.jpg"
                ]
            },
            {
                "description": "In 20 to 30 minutes it should look like this. The soy beans should swell from soaking up the liquid. You can eat them at this stage, but they are even better after they're pickled overnight.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/7b1a0a5175c0160f.jpg"
                ]
            },
            {
                "description": "The little seeds are mustard.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6d556c3db1d5b4ff.jpg"
                ]
            },
            {
                "description": "I used this pickling spice mix from GABAN. This is a whole spice mix, but you can also use a powdered mix.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/f2e054ab72b04ee6.jpg"
                ]
            },
            {
                "description": "Even if you don't have any pickling spice mix, you can combine your favorite spices.",
                "image_urls": []
            },
            {
                "description": "If you are using this GABAN mix, the cloves are really hard, so take them out before serving the soy beans.",
                "image_urls": []
            },
            {
                "description": "Spices that are suitable for pickles include cinnamon, bay leaves, mustard seeds, allspice, and cayenne pepper.",
                "image_urls": []
            },
            {
                "description": "...and dill seeds, too.",
                "image_urls": []
            }
        ]
    },
    {
        "id": 153658,
        "title": "Chirashi Sushi (5 Ingredient Chirashi Sushi)",
        "story": "This is my family's chirashi sushi. It's delicious! Be careful not to eat too much!!!\n\nThe fillings are rather moist, so it makes the entire dish moist and delicious.\nIt's delicious when you use homemade dried shiitake mushrooms. Recipe by Cooking S Papa",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/4811214707228672.jpg",
        "published_at": "2021-05-19T01:12:00+00:00",
        "user": {
            "name": "Isobel",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "80 grams Cooked bamboo shoots in brine",
            "2 eggs' worth Kinshi tamago",
            "3 pieces Dried gourd",
            "1/3 Carrot",
            "1 block Koya tofu",
            "8 Dried shiitake mushrooms",
            "50 grams Kamaboko",
            "1 Shredded nori seaweed",
            "1 Beni shouga red pickled ginger",
            "450 grams White rice",
            "5 cm square Kombu",
            "1 dash less than usual Water",
            "5 tbsp Vinegar",
            "2 tbsp Sugar",
            "1 tsp Salt",
            "300 ml Water from re-hydrating shiitake mushrooms",
            "2 tbsp Soy sauce",
            "1 tbsp each Sugar/mirin/sake",
            "1/2 tsp Japanese dashi stock powder"
        ],
        "steps": [
            {
                "description": "Cook the rice with the konbu. Use a little less water than usual.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6440761806553088.jpg"
                ]
            },
            {
                "description": "Moisten the gourds with water, then rub with a generous amount of salt. Boil for 5 minutes, then finely chop.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5819729064230912.jpg"
                ]
            },
            {
                "description": "Re-hydrate the shiitake mushrooms in 300 ml of water. You will use the liquid later, so keep it. Re-hydrate the koya dofu in water as well (about 3 minutes).",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4809711883911168.jpg"
                ]
            },
            {
                "description": "Chop the gourds, carrots, bamboo shoots, shiitake mushrooms, koya dofu, and kamaboko into 5-8 mm chunks.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6159286829842432.jpg"
                ]
            },
            {
                "description": "Combine all the sushi vinegar ingredients into a pot and turn on the heat. Once the salt and sugar has dissolved, immediately turn off the heat and let cool.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5206515725107200.jpg"
                ]
            },
            {
                "description": "If you cut the kinshi tamago into squares, you can make it look real nice. You can give the rough ends to your kids to eat. Slice the egg crepe to make kinshi tamago.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6621489613766656.jpg"
                ]
            },
            {
                "description": "Simmer the filling ingredients. Bring the liquid to a boil, then cook the shiitake, carrots, and bamboo shoots over low heat. After 15 minutes, add all remaining fillings and let cook for 2 more minutes to let the flavors absorb.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5935611790753792.jpg"
                ]
            },
            {
                "description": "Transfer to a shallow container and let cool. When cooking the rice, cook with a little less water than usual and cook with the konbu. Once cooked, remove the konbu.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6665614228717568.jpg"
                ]
            },
            {
                "description": "Mix up the rice in the rice pot and add the sushi vinegar, then mix into the rice with the rice spatula using cutting motions. Once mixed in, cool with a hand fan to bring out the shine.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5395990610706432.jpg"
                ]
            },
            {
                "description": "Mix together with the cooled fillings, then garnish with the kinshi tamago, shredded nori, and sesame seeds. Serve with the beni shouga and enjoy!",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5042840548671488.jpg"
                ]
            },
            {
                "description": "To make kinshi tamago, see.\n\nhttps://cookpad.com/us/recipes/152675-ultra-thin-and-beautiful-shredded-egg-for-chirashi-sushi",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6309400647041024.jpg"
                ]
            },
            {
                "description": "To make your own dried shiitake mushrooms, see.\n\nhttps://cookpad.com/us/recipes/143982-sun-dried-shiitake-mushrooms-with-butter-and-soy-sauce",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6681685581103104.jpg"
                ]
            },
            {
                "description": "You can make a very colorful chirashi sushi by adding shrimp or salmon, tuna, mackerel, octopus, squid, salmon roe, etc on top!",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5377120671891456.jpg"
                ]
            }
        ]
    },
    {
        "id": 152186,
        "title": "Nostalgic...Ketchup Flavored Udon Noodles",
        "story": "My grandma used to make this for me when I was small. It's stir fried udon noodles (yaki-udon) but for some reason she added a lot of ketchup. I like lots of ketchup in this too!\r\n\r\nBy putting a lid on and steam-cooking  over low heat, you can draw out the sweetness of the vegetables. \r\nThe flavor differs depending on the amount of udon noodles used and the moisture in the vegetables, so please adjust the amount of ketchup and sauce accordingly. \r\nUse more ketchup than Worcestershire-type sauce. Recipe by Kinakorin",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5451502050082816.jpg",
        "published_at": "2021-12-22T01:37:00+00:00",
        "user": {
            "name": "Shelton",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 pack Udon noodles",
            "50 to 100 grams Pork, cut into thin strips",
            "1/8 Cabbage",
            "1 Green bell pepper",
            "5 cm Japanese leek",
            "1 tsp Soy sauce (to pre-season)",
            "1 tbsp Sesame oil",
            "2 1/2 tbsp Ketchup",
            "1 1/2 tbsp Japanese Worcestershire-style sauce",
            "1 Aonori"
        ],
        "steps": [
            {
                "description": "Massage the soy sauce into the pork to pre-season it. Chop up the cabbage, and slice the carrot into short rectangular pieces. Slice the leek and bell pepper thinly.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5981434266255360.jpg"
                ]
            },
            {
                "description": "Heat some sesame oil in a frying pan and stir fry the pork over medium heat. When the color of the meat changes, add the leek, bell pepper and carrot and stir once, then add the cabbage on top (don't mix it in). Put a lid on and steam cook over low heat.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5018481098489856.jpg"
                ]
            },
            {
                "description": "After about 5 minutes the cabbage will have wilted and moisture will be coming out of it. Turn the heat up to medium and add the udon noodles. Mix well, add the ketchup and sauce, and it's done Serve with aonori and bonito flakes on top if you like.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5057445847105536.jpg"
                ]
            }
        ]
    },
    {
        "id": 143851,
        "title": "Simple Poppy-Textured, Tasty Tarako and Carrots",
        "story": "I had this in my o-bento often as a child. It's my mom's style of cooking.\r\nYou can eat a bunch of carrots this way.\r\n\r\nIt's super easy; just cut up the carrots and cook away. Recipe by Erueru286.",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5773467117944832.jpg",
        "published_at": "2021-12-22T01:29:00+00:00",
        "user": {
            "name": "Jerrold",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 tsp Mirin",
            "1 Soy sauce",
            "2 tsp Sesame oil",
            "1 Tarako (salt-cured pollack or cod roe), large",
            "1 Carrot, large"
        ],
        "steps": [
            {
                "description": "Julienne the carrot. Remove the membrane from the tarako and separate the eggs.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5210517164523520.jpg"
                ]
            },
            {
                "description": "Heat the sesame oil in a small sauce pan, and cook carrots. Add mirin and continue cooking.",
                "image_urls": []
            },
            {
                "description": "When the carrots become tender, (to the desired degree ) add the tarako and continue cooking.",
                "image_urls": []
            },
            {
                "description": "When the tarako changes color, add a bit of soy sauce for added aroma, then it's ready to serve.",
                "image_urls": []
            }
        ]
    },
    {
        "id": 151799,
        "title": "Saba Sushi (Cured and Pressed Mackerel Sushi)",
        "story": "I love saba sushi, but it's hard to find one in stores that's made just to my taste, so I make my own. For the sugar marinating step, I've used Chef Hiromitsu Nozaki's method as reference.\n\nAdjust the time you marinate the fish in salt and vinegar to taste. After forming the sushi, if you refrigerate it, the rice will harden. If you wrap the sushi in a towel and put it in the vegetable compartment (the warmest part of the refrigerator) or similar, you can prevent the rice from becoming too hard. Recipe by Monzu kitchen",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/6571179977474048.jpg",
        "published_at": "2021-04-03T01:37:00+00:00",
        "user": {
            "name": "Shavon",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 fish's worth Fresh mackerel (filleted)",
            "4 tbsp Sugar",
            "4 tbsp Salt",
            "5 tbsp Rice vinegar",
            "350 grams Hot cooked rice",
            "3 tbsp Sushi vinegar"
        ],
        "steps": [
            {
                "description": "Rub both sides of the fish fillets with sugar, place in a shallow tray, cover with plastic wrap and refrigerate for 2 hours.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5934301611819008.jpg"
                ]
            },
            {
                "description": "Rinse off both sides of the fillets under running water, and pat dry with paper towels. Rub salt into both sides, place in a shallow tray, cover with plastic wrap and refrigerate for 3 hours.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6561734929154048.jpg"
                ]
            },
            {
                "description": "Rinse off both sides of the fillets under running water, and pat dry with paper towels.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5654849510178816.jpg"
                ]
            },
            {
                "description": "Pour the vinegar into the shallow tray with the fillets placed skin side down. Place a paper towel on top of the fish so that they are immersed in the vinegar. Cover with plastic wrap and refrigerate for 4 hours.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5735174982598656.jpg"
                ]
            },
            {
                "description": "Peel off the skin with your fingers.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6573791707660288.jpg"
                ]
            },
            {
                "description": "Remove any remaining bones with fish bone tweezers.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4778561480163328.jpg"
                ]
            },
            {
                "description": "Wipe off the vinegar well with paper towels.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5584405054619648.jpg"
                ]
            },
            {
                "description": "Wrap the fillets in plastic wrap, and refrigerate for half a day.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5643823389605888.jpg"
                ]
            },
            {
                "description": "Mix sushi vinegar into freshly cooked hot rice using a rice paddle. Fan to cool it down. (I have added some pickled ginger and toasted sesame seeds to the rice here).",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5534067098386432.jpg"
                ]
            },
            {
                "description": "Slice off a bit of the fish in the middle that is thicker than the rest, and stick it on to the tail end to even out the thickness.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4947698668011520.jpg"
                ]
            },
            {
                "description": "Line a makisu (sushi rolling mat) with plastic wrap, and place a mackerel fillet on it skin side down. Cover evenly with sushi rice, and roll with the mat.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5806970763214848.jpg"
                ]
            },
            {
                "description": "Press down with your hands to even out the shape. Secure the mat with elastic bands, leave for 2 to 3 hours and it's done.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4728598058500096.jpg"
                ]
            }
        ]
    },
    {
        "id": 149362,
        "title": "Sushi Rice",
        "story": "Regular sushi rice is a bit sweet, so I made this sushi rice to use in California rolls.\n\nMake sure to thoroughly fan air onto the rice while mixing in cutting motions during Step 2. Recipe by Mie-",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/4740969913122816.jpg",
        "published_at": "2021-03-25T02:00:00+00:00",
        "user": {
            "name": "Jefferson",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1000 grams ★Cooked Rice",
            "6 tbsp ☆Vinegar",
            "3 tbsp ☆Raw cane sugar",
            "3 tsp ☆Soy sauce",
            "2 tsp ☆Salt"
        ],
        "steps": [
            {
                "description": "Combine the ☆ ingredients and mix well until the sugar and salt dissolve.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5687795453526016.jpg"
                ]
            },
            {
                "description": "Add the cooked rice to Step 1 and mix together with cutting motions while fanning. Once it has cooled, it's ready to be used.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5240908837552128.jpg"
                ]
            }
        ]
    },
    {
        "id": 155126,
        "title": "Basil Chicken Piccata with Grainy Mustard",
        "story": "I used my favorite chicken tenders to create a piccata with basil and grainy mustard.\r\n\r\nAdjust the amount of spicy mustard to suit your tastes.\r\nIn Step 5, pour the extra egg mixture over the top of the cooking chicken for more volume.\r\nThey taste delicious as is, but I like to sprinkle with rock salt. Recipe by naonaos.",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/6142288383180800.jpg",
        "published_at": "2021-12-19T09:24:00+00:00",
        "user": {
            "name": "Duncan",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "2 Chicken tenders",
            "1 tsp ●White wine or sake",
            "1 dash ●Salt and pepper",
            "2 tsp ○Mayonnaise",
            "1/2 clove ○Garlic (grated)",
            "2 tsp ○Japanese mustard",
            "1/2 ★Beaten egg",
            "2 tsp ★Grainy mustard",
            "1/2 clove ★Garlic (grated)",
            "1/2 tbsp ☆Cake flour",
            "1/2 tbsp ☆Katakuriko (potato starch flour)",
            "1 Olive oil"
        ],
        "steps": [
            {
                "description": "Remove the sinew from the chicken tenders. Cut with a knife to spread them out to a bigger size. Rub with the ● ingredients.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6033155847880704.jpg"
                ]
            },
            {
                "description": "Grate 1 clove of garlic and divide into 2 portions. Combine the ○ ingredients (for pre-seasoning).",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6596352879362048.jpg"
                ]
            },
            {
                "description": "Gently dry off excess moisture from the Step 1 chicken. Spread the chicken with the combined ○ ingredients from Step 2.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4740954119471104.jpg"
                ]
            },
            {
                "description": "Combine the ingredients and combine the ingredients in separate bowls. Coat the chicken with the ingredients and then dip into the ingredients.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4549498553499648.jpg"
                ]
            },
            {
                "description": "Heat olive oil in a frying pan and slowly cook Step 4 on low heat while covered with a lid. Flip them over and cook the same way until browned.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5990972423929856.jpg"
                ]
            }
        ]
    },
    {
        "id": 153333,
        "title": "Easy Chili Prawn Recipe",
        "story": "I wanted to make a standard family version of prawns in chilli sauce, and after much testing, I settled on this recipe with these amounts.\r\n\r\nDon't touch the prawns too much when they are cooking.\r\nDissolve the katakuriko in the water before adding it to the pan. This will prevent lumps. Recipe by Bakazoku.",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5038917760843776.jpg",
        "published_at": "2021-12-19T06:18:00+00:00",
        "user": {
            "name": "Paul",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "200 grams Shelled prawns and scallion (1)",
            "1 tbsp Katakuriko",
            "2 tbsp Sesame oil",
            "1 ★Scallion",
            "1 ★Doubanjiang (we use 2/3 tsp)",
            "1 1/2 tsp ★Garlic paste",
            "1 1/2 tsp ★Ginger paste",
            "100 ml ☆Water",
            "1 tsp ☆Oyster sauce",
            "2 pinch ☆Chinese soup stock",
            "1/2 tbsp ☆Katakuriko",
            "1 1/2 tbsp ☆Ketchup",
            "1 tbsp ☆Sake",
            "1 tbsp ☆Vinegar",
            "1 tsp ☆Chicken stock granules"
        ],
        "steps": [
            {
                "description": "Put the prawns and starch in a bag and shake it so the prawns are coated. Fry both sides in sesame oil. Fry the ingredients marked ★ off to one side of the pan.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4723030432415744.jpg"
                ]
            },
            {
                "description": "When the prawns have changed colour, add the ingredients marked ☆, mix for 2 minutes and it's done!",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4858280680620032.jpg"
                ]
            }
        ]
    },
    {
        "id": 152448,
        "title": "Sweet Potato Kakiage Fritters",
        "story": "We've been making these fritters in our house for many years.\r\n\r\nThe sweet potatoes cooks through quicker when julienned.\r\n The oil should be 170℃. Recipe by Yuuyuu0221.",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/6296371375112192.jpg",
        "published_at": "2021-12-18T05:27:00+00:00",
        "user": {
            "name": "Gordon",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "1 Japanese sweet potato",
            "200 ml ★Plain flour",
            "1 ★Egg",
            "200 ml ★Water (should make 200 ml when mixed with the egg)",
            "1/2 tsp ★Sugar",
            "1 Oil (to taste)",
            "1 Mentsuyu (to taste)"
        ],
        "steps": [
            {
                "description": "Julienne the sweet potatoes, soak in water, then drain. Heat the oil.",
                "image_urls": []
            },
            {
                "description": "Lightly combine the ★ ingredients in a bowl, coat the sweet potato in the mixture and fry.",
                "image_urls": []
            },
            {
                "description": "Summer Vegetable Bitter Melon Tempura:  https://cookpad.com/en/recipes/154961-tempura-with-summer-vegetables-and-meat-stuffed-bitter-melon",
                "image_urls": []
            },
            {
                "description": "Crispy Shrimp Fritters: https://cookpad.com/en/recipes/146275-crispy-shrimp-vegetable-fritters\n\nhttps://cookpad.com/us/recipes/146275-crispy-shrimp-vegetable-fritters",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6610829318291456.jpg"
                ]
            }
        ]
    },
    {
        "id": 145604,
        "title": "Fried Chicken Breast in Ginger Pork Style",
        "story": "You don't have to use pork all the time for the traditional ginger sauce recipe. Chicken can be a great alternative!\r\n\r\nFry the chicken with the skin side down first and you will have a crispy result. Recipe by Kotori shokudou san.",
        "image_url": "https://cookpad.github.io/global-mobile-hiring/images/recipes/5054270121443328.jpg",
        "published_at": "2021-12-18T02:53:00+00:00",
        "user": {
            "name": "Norbert",
            "image_url": "https://cookpad.github.io/global-mobile-hiring/images/users/5917947429126144.jpg"
        },
        "ingredients": [
            "2 Chicken breasts",
            "1 to coat the chicken Katakuriko",
            "1 Salt and pepper (to taste)",
            "1 piece Ginger",
            "2 tbsp Soy sauce",
            "2 tbsp Mirin",
            "1 tbsp Sake",
            "1 and 1/2 tablespoons Sugar",
            "100 ml Water"
        ],
        "steps": [
            {
                "description": "Flatten the chicken breast to a thin slice. Sprinkle salt and pepper on both sides of the chicken. Coat all sides of the chicken thinly with katakuriko. Fry the chicken with the skin side down.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/6735321327730688.jpg"
                ]
            },
            {
                "description": "Combine the ginger, soy sauce, mirin, sake, sugar and water.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/5849348796579840.jpg"
                ]
            },
            {
                "description": "Fry both sides of the chicken and add the mixed seasonings. Cook over a low heat. When both sides of the chicken absorbs the flavor it is done.",
                "image_urls": [
                    "https://cookpad.github.io/global-mobile-hiring/images/steps/4748008552923136.jpg"
                ]
            }
        ]
    }
]
